app/views/profiles/_profile.html.erb

    <% if profile.id == current_user.profile.id %>
      <h4 class = "centre_text">Your Threads (<%= @user.articles.size %>)</h4>
---
SELECT "articles".* FROM "articles" WHERE "articles"."user_id" = ?  ORDER BY published_at DESC, title ASC  [["user_id", 1]]
SELECT COUNT(*) FROM "articles" WHERE "articles"."user_id" = ?  [["user_id", 1]]