app/views/articles/_article.html.erb

        <img id = "speechBubbleIcon" src= "https://assoc.drupal.org/files/talk_icon.png">
        <h5 id = "numOfComments"><%= article.comments.size %></h5>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 1]]

            <th>Categories: </th>
          <% article.categories.each do |category| %>
---
SELECT "categories".* FROM "categories" INNER JOIN "articles_categories" ON "categories"."id" = "articles_categories"."category_id" WHERE "articles_categories"."article_id" = ?  ORDER BY categories.name  [["article_id", 1]]