app/views/articles/_form.html.erb

      <%= f.label "Categories" %><br />
      <% Category.all.each do |category| %>
---
SELECT "categories".* FROM "categories"  ORDER BY categories.name