app/views/articles/categorySort.html.erb

<div id = "searchCategories">
<% Category.all.each do |category| %>
---
SELECT "categories".* FROM "categories"  ORDER BY categories.name