app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" WHERE (title like '%gems%')  ORDER BY created_at DESC LIMIT 6 OFFSET 0
SELECT "users".* FROM "users"
---
  def index
    @articles = Article.all.paginate(:per_page => 6, :page => params[:page])
    @categories = Category.all
    @users = User.all

SELECT "users".* FROM "users"
---
  def show
    @users = User.all

SELECT  "articles".* FROM "articles" WHERE "articles"."user_id" = ? AND "articles"."id" = ?  ORDER BY published_at DESC, title ASC LIMIT 1  [["user_id", 1], ["id", 2]]
---
  def edit
      @article = current_user.articles.find(params[:id])

INSERT INTO "articles" ("title", "location", "excerpt", "body", "published_at", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @article = current_user.articles.new(article_params)

    respond_to do |format|
      if @article.save

SELECT  "articles".* FROM "articles" WHERE "articles"."user_id" = ? AND "articles"."id" = ?  ORDER BY published_at DESC, title ASC LIMIT 1  [["user_id", 1], ["id", 2]]
UPDATE "articles" SET "published_at" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["published_at", "2019-01-31 09:38:00.000000"], ["updated_at", "2019-01-21 09:40:22.712421"], ["id", 2]]
---
  def update
    @article = current_user.articles.find(params[:id])
    respond_to do |format|
      if @article.update(article_params)