app/controllers/comments_controller.rb

    def create
        @comment = @article.comments.new(comment_params)
        if @comment.save
---
INSERT INTO "comments" ("name", "email", "body", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

    def destroy
        @article = current_user.articles.find(params[:article_id])
        @comment = @article.comments.find(params[:id])
        @comment.destroy
---
SELECT  "articles".* FROM "articles" WHERE "articles"."user_id" = ? AND "articles"."id" = ?  ORDER BY published_at DESC, title ASC LIMIT 1  [["user_id", 1], ["id", 2]]
SELECT  "comments".* FROM "comments" WHERE "comments"."article_id" = ? AND "comments"."id" = ? LIMIT 1  [["article_id", 2], ["id", 2]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 2]]

    def load_article
        @article = Article.find(params[:article_id])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]