app/controllers/profiles_controller.rb

  def update
    if @profile.update(profile_params)
---
UPDATE "profiles" SET "name" = ?, "updated_at" = ? WHERE "profiles"."id" = ?  [["name", "Aslam"], ["updated_at", "2019-01-21 11:13:49.466048"], ["id", 2]]

    def set_profile
      @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]