app/controllers/users_controller.rb

SELECT  "users".* FROM "users" LIMIT 10 OFFSET 0
---
    def index
        @users = User.all.paginate(:per_page => 10, :page => params[:page])

INSERT INTO "profiles" ("name", "bio", "twitter", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Name"], ["bio", "Bio"], ["twitter", "TwitterHandle"], ["created_at", "2019-01-15 09:31:41.282851"], ["updated_at", "2019-01-15 09:31:41.282851"]]
INSERT INTO "users" ("email", "hashed_password", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["email", "17100283@lums.edu.pk"], ["hashed_password", "f865b53623b121fd34ee5426c792e5c33af8c227"], ["created_at", "2019-01-15 09:31:41.342477"], ["updated_at", "2019-01-15 09:31:41.342477"]]
---
    def create
        @user = User.new(user_params)
        @user.profile = @profile
        if @user.save